namespace BudMayster.Interfaces
{
    public interface IOrder
    {
        /*-Повинен бути метод що додає матеріал до замовлення з вказаною кількістю.
        -Повинен бути метод що видаляє матеріал із замовлення.
        -Повинен бути метод що розраховує загальну вартість замовлення.
        -Повинен бути метод що виводить інформацію про замовлення, включаючи список матеріалів та загальну суму.
        Призначення:
        -Забезпечує створення, редагування та відображення замовлень.
        -Дозволяє розраховувати загальну вартість замовлення.*/

        void AddMaterial(IМaterial material, int quantity);
        void RemoveMaterial(IМaterial material);
        decimal CalculateTotal();
        void DisplayOrder();
    }
}
