namespace BudMayster.Interfaces
{
    public interface IМaterial
    {
        /*Повинен бути метод що повертає назву матеріалу.
        Повинен бути метод що визначає кількість матеріалу.
        Повинен бути метод що повертає ціну за одиницю матеріалу.
        Повинен бути метод що виводить інформацію про матеріал (назва, кількість, ціна).
        Призначення:
        -Забезпечує уніфікований спосіб роботи з матеріалами.
        -Дозволяє відображати інформацію про матеріал у стандартизованому форматі.*/

        string Name { get; }
        int Quantity { get; set; }
        decimal Price { get; }
        void DisplayInfo();
    }
}
